# language: ru
@calc
Функциональность: графический калькулятор Google

  @smoke @plus @minus @positive
  Структура сценария: простой ввод
    Дано открыта страница Google с калькулятором
    Если набрать на клавиатуре калькулятора "<Выражение>"
    Тогда в поле результата будет "<Результат>"
    Примеры:
      | Выражение        | Результат |
      | 1 + 2 - 3 =      | 0         |
      | 22 + 11 - 33 =   | 0         |
      | 99 + 11 - 1000 = | -890      |
      | 2 * 2 / 4 =      | 1         |
      | 14 / 7 % * 80 =  | 16000     |
      | 1 / 0 =          | Infinity  |
      | 999999999 x! =   | Infinity  |



